#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <MiniFB.h>

// const int SCALE = 3;
// const int WIN_WIDTH = 256 * SCALE;
// const int WIN_HEIGHT = 256 * SCALE;
#define SCALE 3
#define WIN_WIDTH 256*SCALE
#define WIN_HEIGHT 256*SCALE

// const int FB_WIDTH = 256;
// const int FB_HEIGHT = 224;
#define FB_WIDTH 256
#define FB_HEIGHT 224

typedef unsigned char uint8;
typedef unsigned short uint16;
typedef unsigned int add24;
// typedef unsigned char bool;

void WriteBus(add24 address, uint8 data);
uint8 ReadBus(add24 address);

uint8 SPCRead(uint16 address);
void SPCWrite(uint16 address, uint8 data);

#pragma region System_Vars
// System Variables
bool cpuVBlankIntLatch = false;
bool cpuHBlankIntLatch = false;
bool vBlankEntryMoment = false;
bool hdmaRan = true;
unsigned int vblanktimer = 1;

uint64_t emuStep = 0;

// System Regs
uint8 zeroWire = 0;
uint8 ram[128 * 1024] = {0};
uint8 NMITIMEN; // 0x4200
uint8 HTIMEL;   // 0x4207
uint8 HTIMEH;   // 0x4208
uint8 VTIMEL;   // 0x4209
uint8 VTIMEH;   // 0x420a
uint8 TIMEUP;   // 0x4211
uint8 MEMSEL;   // 0x420D
uint8 RDNMI;
uint8 WMDATA; // 0x2180
uint8 WMADDL; // 0x2181
uint8 WMADDM; // 0x2182
uint8 WMADDH; // 0x2183

// GUI

struct mfb_window *window;
uint32_t window_fb[WIN_WIDTH * WIN_HEIGHT];
#pragma endregion

#pragma region APU_Vars
// APU
uint8 aram[64 * 1024] = {0};
uint8 arom[] = {
    0xCD, 0xEF,
    0xBD,
    0xE8, 0x00,
    0xC6,
    0x1D,
    0xD0, 0xFC,
    0x8F, 0xAA, 0xF4,
    0x8F, 0xBB, 0xF5,
    0x78, 0xCC, 0xF4,
    0xD0, 0xFB,
    0x2F, 0x19,
    0xEB, 0xF4,
    0xD0, 0xFC,
    0x7E, 0xF4,
    0xD0, 0x0B,
    0xE4, 0xF5,
    0xCB, 0xF4,
    0xD7, 0x00,
    0xFC,
    0xD0, 0xF3,
    0xAB, 0x01,
    0x10, 0xEF,
    0x7E, 0xF4,
    0x10, 0xEB,
    0xBA, 0xF6,
    0xDA, 0x00,
    0xBA, 0xF4,
    0xC4, 0XF4,
    0xDD,
    0x5D,
    0xD0, 0xDB,
    0x1F, 0x00, 0x00,
    0xC0, 0xFF};

uint8 APUIO0;
uint8 APUIO1;
uint8 APUIO2;
uint8 APUIO3;

uint8 CPUIO0;
uint8 CPUIO1;
uint8 CPUIO2;
uint8 CPUIO3;

// Timers
bool t0En = 0;
bool t1En = 0;
bool t2En = 0;

uint8 t0Val = 0;
uint8 t1Val = 0;
uint8 t2Val = 0;

uint16 t0div = 1;
uint16 t1div = 1;
uint16 t2div = 1;

bool ramRomSel = 1;

uint32_t stepCnt = 0;
uint16 t0Clk = 0;
uint16 t1Clk = 0;
uint16 t2Clk = 0;
#pragma endregion

#pragma region ROM_Vars
typedef enum
{
    LoROM,
    HiROM,
    ExHiROM
} ROMMapType;

unsigned char *rom;
unsigned char *sram;
bool hasSram = 0;
int romSize;
int sramSize = 0;
ROMMapType romMapType;
char title[21];
bool speed; // 0=Slow , 1=Fast
#pragma endregion

#pragma region CPU_Vars
const uint8_t flagNMask = 0b10000000;
const uint8_t flagVMask = 0b01000000;
const uint8_t flagMMask = 0b00100000;
const uint8_t flagXMask = 0b00010000;
const uint8_t flagDMask = 0b00001000;
const uint8_t flagIMask = 0b00000100;
const uint8_t flagZMask = 0b00000010;
const uint8_t flagCMask = 0b00000001;
typedef struct
{
    bool N;
    bool V;
    bool M;
    bool X;
    bool D;
    bool I;
    bool Z;
    bool C;
} CPUFlagsRegister;

typedef struct
{
    uint16 C;  // accumulator 16 bit
    uint8 DBR; // data bank register 8 bit
    uint16 D;  // Direct 16 bit
    uint8 K;   // Program Bank 8 bit
    uint16 PC; // PC 16 bit
    uint16 S;  // Stack 16 bit
    uint16 X;  // X 16 bit
    uint16 Y;  // Y 16 bit
} CPURegisters;

typedef enum
{
    CPU_AM_Abs = 0,
    CPU_AM_AbsX = 1,
    CPU_AM_AbsY = 2,
    CPU_AM_AbsPtr16 = 3,
    CPU_AM_AbsPtr24 = 4,
    CPU_AM_AbsXPtr16 = 5,
    CPU_AM_Dir = 6,
    CPU_AM_DirX = 7,
    CPU_AM_DirY = 8,
    CPU_AM_DirPtr16 = 9,
    CPU_AM_DirPtr24 = 10,
    CPU_AM_DirXPtr16 = 11,
    CPU_AM_DirPtr16Y = 12,
    CPU_AM_DirPtr24Y = 13,
    CPU_AM_Imm = 14,
    CPU_AM_Long = 15,
    CPU_AM_LongX = 16,
    CPU_AM_Rel8 = 17,
    CPU_AM_Rel16 = 18,
    CPU_AM_SrcDst = 19,
    CPU_AM_STK = 20,
    CPU_AM_STKPtr16Y = 21
} CPUAddressingMode;

CPUFlagsRegister flags; // Status Reg
CPURegisters cregs;
bool flagE;
uint8_t inst;
add24 addL, addH, addXH;
#pragma endregion

#pragma region CTRL_Vars
typedef struct
{
    uint8 LOW;
    uint8 HIGH;
} ControllerRegs;
ControllerRegs ctrl[4];
uint8 LCTRLREG1;
uint8 LCTRLREG2;
uint8 HVBJOY;
uint8 RDIO;
uint8 WRIO;
uint16 player1;
bool stdCtrlEn = 1;

uint8 legCnt1 = 0;
#pragma endregion

#pragma region PPU_Vars



typedef struct
{
    bool objVisible;
    bool size;
    uint8 objY;
    int16_t objX;
    uint8 objChrName;
    bool objChrTable;
    uint8 objClrPal;
    uint8 objPrior;
    bool objHF;
    bool objVF;
} PPUObject;

uint32_t fb[FB_WIDTH * FB_HEIGHT];

// VRam
uint16 vram[32 * 1024] = {0};
uint16 vramAddr = 0;
uint16 vramPtr = 0;

// CGRam
uint16 cgram[256] = {0};
bool cgDataHL = false;
uint8 cgAddr = 0;

// OAM , Object data
uint16 oam[272] = {0};
uint16 oamAddr = 0;
bool oamDataHL = false;
PPUObject objs[128];

// Counters
uint16 hCounter = 0;
uint16 vCounter = 0;
bool hCounterLatchHL = false;
bool vCounterLatchHL = false;
uint16 hCounterLatch = 0;
uint16 vCounterLatch = 0;

// BGs and Mode
uint8 mode;
bool bg3PriorMode;
bool bg1ChrSize;
bool bg2ChrSize;
bool bg3ChrSize;
bool bg4ChrSize;
bool directColor;

uint16 BG1BaseAddr;
uint16 BG2BaseAddr;
uint16 BG3BaseAddr;
uint16 BG4BaseAddr;
uint16 BG1ChrsBaseAddr;
uint16 BG2ChrsBaseAddr;
uint16 BG3ChrsBaseAddr;
uint16 BG4ChrsBaseAddr;

bool BG1onMainScreen = false;
bool BG2onMainScreen = false;
bool BG3onMainScreen = false;
bool BG4onMainScreen = false;
bool OBJonMainScreen = false;
bool BG1onSubScreen = false;
bool BG2onSubScreen = false;
bool BG3onSubScreen = false;
bool BG4onSubScreen = false;
bool OBJonSubScreen = false;

uint8 BG1SCSize = 0;
uint8 BG2SCSize = 0;
uint8 BG3SCSize = 0;
uint8 BG4SCSize = 0;
uint8 objAvailSize = 0;

bool BG1HScrollHL = false;
bool BG1VScrollHL = false;
uint16 BG1HScroll = 0;
uint16 BG1VScroll = 0;

bool BG2HScrollHL = false;
bool BG2VScrollHL = false;
uint16 BG2HScroll = 0;
uint16 BG2VScroll = 0;

bool BG3HScrollHL = false;
bool BG3VScrollHL = false;
uint16 BG3HScroll = 0;
uint16 BG3VScroll = 0;

bool BG4HScrollHL = false;
bool BG4VScrollHL = false;
uint16 BG4HScroll = 0;
uint16 BG4VScroll = 0;

// Mode 7
uint16 mode7A = 0;
uint16 mode7B = 0;
uint16 mode7C = 0;
uint16 mode7D = 0;
uint16 centerX = 0;
uint16 centerY = 0;
uint8 mode7Old = 0;
int32_t mult = 0;
uint8 M7SEL;

bool mode7AHL = false;
bool mode7BHL = false;
bool mode7CHL = false;
bool mode7DHL = false;
bool centerXHL = false;
bool centerYHL = false;

// Frame
bool hBlank = false, vBlank = false;
int frameCount = 0;
bool vBlankInt = false;
bool interlacing = false;
uint8 fadeValue = 0xFF;
bool forceBlank = false;

bool addSub = false;
bool addSubHalf = false;
bool bg1AddSub = false;
bool bg2AddSub = false;
bool bg3AddSub = false;
bool bg4AddSub = false;
bool objAddSub = false;
bool bdpAddSub = false;

uint16 constColor = 0;
bool constColorSel = 0;

// Objs
uint16 OBJChrTable1BaseAddr;
uint16 OBJChrTable2BaseAddr;

// Debug
uint8 bgFilter = 0;
bool pauseEmu = false;

uint8 VMAINC = 0;
uint8 OPHCT = 0;
uint8 OPVCT = 0;
uint8 MOSAIC = 0;

// Window
uint8 TMW;
uint8 TSW;
uint8 W12SEL;
uint8 W34SEL;
uint8 WOBJSEL;
uint8 WH0;
uint8 WH1;
uint8 WH2;
uint8 WH3;
uint8 WBGLOG;
uint8 WOBJLOG;
#pragma endregion

#pragma region SPC700_Vars


const uint8_t spc700_FlagNMask = 0b10000000;
const uint8_t spc700_FlagVMask = 0b01000000;
const uint8_t spc700_FlagPMask = 0b00100000;
const uint8_t spc700_FlagBMask = 0b00010000;
const uint8_t spc700_FlagHMask = 0b00001000;
const uint8_t spc700_FlagIMask = 0b00000100;
const uint8_t spc700_FlagZMask = 0b00000010;
const uint8_t spc700_FlagCMask = 0b00000001;
typedef enum
{
    SPC700_AM_Imm = 0,
    SPC700_AM_Abs = 1,
    SPC700_AM_AbsX = 2,
    SPC700_AM_AbsY = 3,
    SPC700_AM_XPtr = 11,
    SPC700_AM_YPtr = 12,
    SPC700_AM_DP = 4,
    SPC700_AM_DPX = 5,
    SPC700_AM_DPY = 6,
    SPC700_AM_DPPtrY = 7,
    SPC700_AM_DPXPtr = 8,
    SPC700_AM_STK = 9,
    SPC700_AM_SrcDst = 10,
    SPC700_AM_MemBit = 13,
} SPC700AddressingMode;

typedef struct
{
    bool N;
    bool V;
    bool P;
    bool B;
    bool H;
    bool I;
    bool Z;
    bool C;
} SPC700Flags;

typedef struct
{
    uint8 A;
    uint8 X;
    uint8 Y;
    uint16 PC;
    uint8 SP;
} SPC700Regs;

SPC700Flags SPC_flags;
SPC700Regs SPC_regs;
uint16 SPC_cycles;
uint16 SPC_addL;
uint16 SPC_addH;

#pragma endregion

#pragma region DMA_Vars
uint8 MDMAEN; // What channels to start immediately, each flag is cleared after finishing
uint8 HDMAEN; // What channels to start after HBlank
bool dmaActive = false;

uint16 dmaAAddr[8] = {0};
uint8 dmaAAddrBank[8] = {0};
add24 dmaBAddr[8] = {0};
uint16 dmaDataPtr[8] = {0};
uint8 dmaIndirBank[8] = {0};
uint16 dmaTablePtr[8] = {0};
uint8 dmaUnused[8] = {0};
bool dmaDir[8] = {0};
bool dmaFixedAddr[8] = {0};
bool dmaDecAddr[8] = {0};
uint8 dmaType[8] = {0};
bool dmaIndir[8] = {0};
bool dmaEn[8] = {0};
bool hdmaEn[8] = {0};
bool dmaCont[8] = {0};
uint8 dmaLineCnt[8] = {0};
bool hdmaDoTransfer[8] = {0};

uint8 state = 0;
#pragma endregion

#pragma region MDU_Vars
 uint8 WRMPYA; // 0X4202
    uint8 WRMPYB; // 0X4203
    uint8 WRDIVL; // 0X4204
    uint8 WRDIVH; // 0X4205
    uint8 WRDIVB; // 0X4206

    uint8 RDDIVL; // 0x4214
    uint8 RDDIVH; // 0x4215
    uint8 RDMPYL; // 0x4216
    uint8 RDMPYH; // 0x4217
#pragma endregion

void exitEmu()
{

    mfb_close(window);
    exit(0);
}


#pragma region CPU
add24 PCByteAhead(uint8 n)
{
    return ((add24)cregs.K << 16) | (((add24)cregs.PC + n) & 0x00FFFF);
}


uint16 ReadWord()
{
    uint16 low = ReadBus(addL);
    uint16 high = ReadBus(addH);
    return (high << 8) | low;
}
void WriteWord(uint16 data)
{
    WriteBus(addL, data & 0x00FF);
    WriteBus(addH, data >> 8);
}

uint16 ReadWordAt(add24 add)
{
    uint16 low = ReadBus(add);
    uint16 high = ReadBus(add + 1);
    return (high << 8) | low;
}
void WriteWordAt(add24 add, uint16 data)
{
    WriteBus(add, data & 0x00FF);
    WriteBus(add + 1, data >> 8);
}

void ResolveAddress(CPUAddressingMode mode)
{
    uint8 ll, hh, xh;
    ll = ReadBus(PCByteAhead(1));
    hh = ReadBus(PCByteAhead(2));
    xh = ReadBus(PCByteAhead(3));

    // Phase one
    switch (mode)
    {
    case CPU_AM_Rel8:
    case CPU_AM_Rel16:
    case CPU_AM_Imm:
        addL = PCByteAhead(1);
