#include <bits/stdc++.h>
#include <MiniFB.h>
#include <assert.h>
using namespace std;
typedef unsigned char uint8;
typedef unsigned short uint16;
typedef unsigned int add24;

struct PPURegs
{
    uint8 INIDISP; // 0x2100 INITIAL SETTINGS FOR SCREEN

    uint8 OBJSEL; // 0x2101 OBJ SIZE AND DATA AREA DESIGNATION

    uint8 OAMADDL; // 0x2102
    uint8 OAMADDH; // 0x2103 OAM ADDRESS
    uint8 OAMDATA; // 0x2104 : Write, 0x2138 : Read

    uint8 BGMODE; // 0x2105

    uint8 MOSAIC; // 0x2106

    uint8 BG1SC; // 0x2107
    uint8 BG2SC; // 0x2108
    uint8 BG3SC; // 0x2109
    uint8 BG4SC; // 0x210A

    uint8 BG12NBA; // 0x210B
    uint8 BG34NBA; // 0x210C

    uint8 BG1H0FS; // 0x210D
    uint8 BG1V0FS; // 0x210E

    uint8 BG2H0FS; // 0X210F
    uint8 BG2V0FS; // 0X2110
    uint8 BG3H0FS; // 0X2111
    uint8 BG3V0FS; // 0X2112
    uint8 BG4H0FS; // 0X2113
    uint8 BG4V0FS; // 0X2114

    uint8 VMAINC; // 0X2115

    uint8 VMADDL; // 0x2116
    uint8 VMADDH; // 0x2117

    uint8 VMDATAL; // 0x2118
    uint8 VMDATAH; // 0x2119

    // Mode 7
    uint8 M7SEL; // 0x211A
    uint8 M7A;   // 0x211B Rotation
    uint8 M7B;   // 0x211C Enlargement
    uint8 M7C;   // 0x211D Reduction, Center, Multiplicand
    uint8 M7D;   // 0x211E Multiplier settings
    uint8 M7X;   // 0x211F Operand
    uint8 M7Y;   // 0x2120 Operand

    uint8 CGADD;  // 0x2121
    uint8 CGDATA; // 0x2122

    uint8 W12SEL;  // 0x2123
    uint8 W34SEL;  // 0x2124
    uint8 WOBJSEL; // 0x2125

    uint8 WH0; // 0x2126
    uint8 WH1; // 0x2127
    uint8 WH2; // 0x2128
    uint8 WH3; // 0x2129

    uint8 WBGLOG;  // 0x212A
    uint8 WOBJLOG; // 0x212B

    uint8 TM; // 0x212C

    uint8 TS; // 0x212D

    uint8 TMW; // 0x212E

    uint8 TSW; // 0x212F

    uint8 CGSWSEL; // 0x2130

    uint8 CGADSUB; // 0x2131

    uint8 COLDATA; // 0x2132

    uint8 SETINI; // 0x2133

    uint8 MPYL; // 0x2134
    uint8 MPYM; // 0x2135
    uint8 MPYH; // 0x2136

    uint8 SLHV; // 0x2137

    // The following might get merged with the write regs
    uint8 OAMDATA_READ; // 0x2138
    uint8 VMDATAL_READ; // 0x2139
    uint8 VMDATAH_READ; // 0x213A
    uint8 CGDATA_READ;  // 0x213B

    uint8 OPHCT; // 0x213C
    uint8 OPVCT; // 0x213D

    uint8 STAT77; // 0x213E
    uint8 STAT78; // 0x213F
};
const int FB_WIDTH = 256;
const int FB_HEIGHT = 224;

struct Object
{
    bool objVisible;
    bool size;
    uint8 objY;
    int16_t objX;
    uint8 objChrName;
    bool objChrTable;
    uint8 objClrPal;
    uint8 objPrior;
    bool objHF;
    bool objVF;
};

class PPU
{

public:
    uint32_t fb[FB_WIDTH * FB_HEIGHT];

    PPURegs regs;

    // VRam
    uint16 vram[32 * 1024] = {0};
    uint16 vramAddr = 0;
    uint16 vramPtr = 0;

    // CGRam
    uint16 cgram[256] = {0};
    bool cgDataHL = false;
    uint8 cgAddr = 0;

    // OAM , Object data
    uint16 oam[272] = {0};
    uint16 oamAddr = 0;
    bool oamDataHL = false;
    Object objs[128];

    // Counters
    uint16 hCounter = 0;
    uint16 vCounter = 0;
    bool hCounterLatchHL = false;
    bool vCounterLatchHL = false;
    uint16 hCounterLatch = 0;
    uint16 vCounterLatch = 0;

    // BGs and Mode
    uint8 mode;
    bool bg3PriorMode;
    bool bg1ChrSize;
    bool bg2ChrSize;
