#include <bits/stdc++.h>
#include <MiniFB.h>
#include <chrono>

using namespace std;

typedef unsigned char uint8;
typedef unsigned short uint16;
typedef unsigned int add24;

#include "Cartridge.cpp"
#include "PPU.cpp"
#include "APU.cpp"
#include "CPU.cpp"
#include "DMA.cpp"
#include "CTRL.cpp"
#include "MDUnit.cpp"

Cartridge *rom;
CPU *cpu;
PPU *ppu;
DMA *dma;
MDUnit *mdu;
ControllerSystem *ctrlsys;

uint8 zeroWire = 0;
uint8 ram[128 * 1024] = {0};

uint8 NMITIMEN; // 0x4200
uint8 HTIMEL;   // 0x4207
uint8 HTIMEH;   // 0x4208
uint8 VTIMEL;   // 0x4209
uint8 VTIMEH;   // 0x420a
uint8 TIMEUP;   // 0x4211
uint8 MEMSEL;   // 0x420D

uint8 WMDATA; // 0x2180

uint8 WMADDL; // 0x2181
uint8 WMADDM; // 0x2182
uint8 WMADDH; // 0x2183

uint8 RDNMI;

uint8 C65Read(add24 address);
void C65Write(add24 address, uint8 data);

uint8 DMARead(add24 address);
void DMAWrite(add24 address, uint8 data);

uint8 BusAccess(add24 address, uint8 data, bool rd);

unsigned int vblanktimer = 1;

bool cpuVBlankIntLatch = false;
bool cpuHBlankIntLatch = false;
bool vBlankEntryMoment = false;
bool hdmaRan = true;

// GUI
const int SCALE = 3;
const int WIN_WIDTH = 256 * SCALE;
const int WIN_HEIGHT = 256 * SCALE;
struct mfb_window *window;
uint32_t window_fb[WIN_WIDTH * WIN_HEIGHT];

// Debugging tools
bool debug = false;
bool pauseEmu = true;
bool runStep = false;
bool runVBlank = false;
bool runInst = false;
bool runHBlank = false;
bool cpuTrace = false;
uint16 mouseX, mouseY;
ofstream cpuTraceFile;

void DumpVRam()
{
    ofstream outFile("VRAMDump.bin", std::ios::binary);

    outFile.write(reinterpret_cast<const char *>(ppu->vram), (size_t)32 * 1024 * sizeof(uint16));

    outFile.close();
}
void DumpOARam()
{
